## Plan for aws/lambda
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `aws_api_gateway_account.api_cloudwatch`           |
|        | `aws_api_gateway_method_settings.settings[&quot;dev&quot;]`  |
|        | `aws_api_gateway_method_settings.settings[&quot;prod&quot;]` |
|        | `aws_cloudwatch_log_group.api_gateway_log_group`   |
|        | `aws_iam_role.api_cloudwatch`                      |
|        | `aws_iam_role_policy_attachment.api_cloudwatch`    |
| update | `aws_lambda_function.api_handler`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be created
  + resource "aws_api_gateway_account" "api_cloudwatch" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_api_gateway_method_settings.settings["dev"] will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "7s14db9pfd"
      + stage_name  = "dev"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = (known after apply)
          + throttling_rate_limit                      = (known after apply)
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_method_settings.settings["prod"] will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "7s14db9pfd"
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = (known after apply)
          + throttling_rate_limit                      = (known after apply)
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "api_gateway_log_group"
      + retention_in_days = 7
    }

  # aws_iam_role.api_cloudwatch will be created
  + resource "aws_iam_role" "api_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ApiGatewayCloudWatchRole"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.api_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "api_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "ApiGatewayCloudWatchRole"
    }

  # aws_lambda_function.api_handler will be updated in-place
  ~ resource "aws_lambda_function" "api_handler" {
        arn                            = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda"
        filename                       = "./deployment.zip"
        function_name                  = "secret-production-lambda"
        handler                        = "app.app"
        id                             = "secret-production-lambda"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda/invocations"
      ~ last_modified                  = "2023-10-03T23:27:09.000+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-lambda:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::637287734259:role/secret-production-lambda-iam-role"
        runtime                        = "python3.8"
      ~ source_code_hash               = "ThitElRPCJBqcIrvtjdItL/3Tsqa9qh33W8qY7dnSJ8=" -> "QCPSbgVpC80xzOW1b7SkUcVYLlUjN3XQzLP/D/kgv8M="
        source_code_size               = 14082514
        tags                           = {
            "CostCenter" = "secret-production"
            "Name"       = "secret"
        }
        timeout                        = 60
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
                "DYNAMO_TABLE"            = "secret-production-table"
                "ENV"                     = "PRODUCTION"
              ~ "GIT_SHA"                 = "2a08c8faffe6562b1822e092118a648ab1268100" -> "abcdefgh"
                "KMS_ID"                  = "5e112d26-23c0-473d-afbb-2c74deab0894"
                "POWERTOOLS_SERVICE_NAME" = "secret"
            }
        }

        tracing_config {
            mode = "Active"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.rest-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.dynamodb-table"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda-iam-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.key"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.lambda-warmer"]

28 tests, 17 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
